{"sections":{"main":{"type":"page-about-us","settings":{}},"custom-content":{"type":"custom-content","blocks":{"be5d2488-3c71-471f-bb75-dbccb6970cb0":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/Group-1171275365-1.jpg","link":"","width":"50%","alignment":"center","block_custom_class":"","animations":"inherit"}},"f5e88f1f-ff68-4d03-b686-0cb9fe62fab1":{"type":"text","settings":{"title":"MEET MOOVOGUE","subheading":"","text":"<p>Welcome to Moovogue, your one-stop destination for trendy and animal-friendly women's apparel, accessories, shoes, jewelry, and adorable selections for babies and kids. At Moovogue, we believe that fashion can be both stylish and compassionate. That's why we specialize in offering a delightful range of cow-printed products that are making a bold comeback in the market.<\/p><p><\/p><p>Cow print fashion has recently taken the fashion world by storm, captivating fashionistas and trendsetters everywhere. Our team at Moovogue recognized this growing demand and wanted to create a brand that celebrates the beauty of animal-inspired fashion without compromising on our values.<\/p><p><\/p><p>We understand the significance of animal welfare and sustainability in today's world. That's why all our products are made using high-quality, animal-friendly materials. We are committed to ensuring that no animals are harmed in the making of our merchandise, allowing you to indulge in the latest trends guilt-free.<\/p><p><\/p><p>Our collection is thoughtfully curated to cater to the diverse tastes and preferences of our customers. Whether you're searching for a statement cow-print dress, a chic cow-patterned handbag, or even adorable cow-themed outfits for your little ones, we have it all. With our wide range of products, we strive to offer you an unforgettable shopping experience, where you can discover unique and stylish pieces that reflect your personality.<\/p><p><\/p><p>At Moovogue, we pride ourselves on our exceptional customer service. Our dedicated team is passionate about assisting you in finding the perfect cow-print fashion items that will make you stand out from the crowd. We value your trust and strive to build long-lasting relationships with our customers.<\/p><p><\/p><p>Join us in embracing the return of cow print fashion and experience the joy of expressing your style while promoting animal-friendly choices. Step into Moovogue, where trendy meets ethical, and embark on a fashion journey like no other.<\/p><p><\/p><p>Explore our collection today and let your inner fashionista roam free in the world of cow print fashion!<\/p>","width":"50%","alignment":"center","align_text":"center","text_size":"medium","text_color":"black","button_label":"","button_link":"","button_style":"m-button--primary","button_size":"","block_custom_class":"sf__about-block sf__about-block-text sf__about-block-text-1","animations":"inherit"}}},"block_order":["be5d2488-3c71-471f-bb75-dbccb6970cb0","f5e88f1f-ff68-4d03-b686-0cb9fe62fab1"],"custom_css":["@media (min-width: 1280px) {#m-custom__block--9a3a8077-de29-4141-9162-b9484d4a85f8 {padding-left: 100px; }}"],"settings":{"heading":"","heading_size":"h2","subheading":"","description":"","header_alignment":"center","container":"container-fluid","color_scheme":"","content_color_scheme":"","enable_parallax":false,"parallax_direction":"vertical","gap":30,"gap_mobile":16,"use_scroll_mobile":false,"padding_top":0,"padding_bottom":0,"custom_class":"m-about-page"}}},"order":["main","custom-content"]}